/*********************************************************************************************************
*
* 作    者 ：李晨洋
*	模块名称 : ADF4351 驱动模块
*	文件名称 : ADF4351.h
*
*********************************************************************************************************/
/********************************************************************************************************
      ADF4351模块接线表
      +5V   <------  5.0V      5V供电
      GND   -------  GND       地
			
			
			LD    ------->  PB       锁定检测引脚
			MUX   ------->  PB       多路复用器输出
			GND   ------->  GND      数字地
			SCLK  ------->  PB15     时钟
			DATA  ------->  PB14     数据
			LE    ------->  PB13     加载使能
			CE    ------->  PB12     芯片使能
			
			
			
			ADF4351基本特性:
			
	    1、ADF4350/ADF4351具有一个集成电压控制振荡器(VCO)，其基波输出频率范围为2200 MHz至4400 MHz。
			2、此外，利用1/2/4/8/16分频电路，用户可以产生低至35Mhz/137.5 MHz的RF输出频率。
			3、对于要求隔离的应用，RF输出级可以实现静音。
			4、静音功能既可以通过引脚控制，也可以通过软件控制。
			5、同时提供辅助RF输出，且不用时可以关断。
			6、输出频率范围：137.5 MHz至4400 MHz；
			7、小数N分频频率合成器和整数N分频频率合成器；
			8、具有低相位噪声的VCO；
			9、可编程1/2/4/8/16分频输出；
			10、均方根(RMS)抖动：小于0.4 ps rms（典型值）；
			11、电源电压：3.0 V至3.6 V；
			12、逻辑兼容性：1.8 V；
			13、可编程双模预分频器：4/5或8/9；
			14、可编程的输出功率；
			15、RF输出静音功能；
			16、三线式串行接口；
			17、模拟和数字锁定检测；
			18、在宽带宽内快速锁定模式；
			19、周跳减少；
			
			调试记录
	    (1) 设置寄存器时，SCK过快导致芯片不能每次都收到数据。原因: 发送的相邻的字节之间需要延迟一小段时间.
	    (2) 连续复位CPU时，偶尔出现芯片输出采样率异常。
			(3) f103和f407之间的区别较大，在程序移植的时候注意内核的配置及
			
**********************************************************************************************************/
#ifndef _ADF4351_H_
#define _ADF4351_H_

#include "sys.h"

#define ADF4351_CLK PBout(15)
#define ADF4351_OUTPUT_DATA PBout(14)
#define ADF4351_LE PBout(13)
#define ADF4351_CE PBout(12)

#define ADF4351_INPUT_DATA PBin(14)


void ADF4351Init(void);
void ReadToADF4351(u8 count, u8 *buf);
void WriteToADF4351(u8 count, u8 *buf);
void WriteOneRegToADF4351(u32 Regster);
void ADF4351_Init_some(void);
void ADF4351WriteFreq(float Fre);		//	(xx.x) M Hz

#endif

